balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F96J99.PIC
              <edc:DCRFieldSemantic edc:cname="WPFP165" edc:desc="Write Protect Program Flash Page 165" edc:when="(field &amp; 0xff) == 0xA5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP166" edc:desc="Write Protect Program Flash Page 166" edc:when="(field &amp; 0xff) == 0xA6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP167" edc:desc="Write Protect Program Flash Page 167" edc:when="(field &amp; 0xff) == 0xA7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP168" edc:desc="Write Protect Program Flash Page 168" edc:when="(field &amp; 0xff) == 0xA8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP169" edc:desc="Write Protect Program Flash Page 169" edc:when="(field &amp; 0xff) == 0xA9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP170" edc:desc="Write Protect Program Flash Page 170" edc:when="(field &amp; 0xff) == 0xAA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP171" edc:desc="Write Protect Program Flash Page 171" edc:when="(field &amp; 0xff) == 0xAB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP172" edc:desc="Write Protect Program Flash Page 172" edc:when="(field &amp; 0xff) == 0xAC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP173" edc:desc="Write Protect Program Flash Page 173" edc:when="(field &amp; 0xff) == 0xAD"/>
              <edc:DCRFieldSemantic edc:cname="WPFP174" edc:desc="Write Protect Program Flash Page 174" edc:when="(field &amp; 0xff) == 0xAE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP175" edc:desc="Write Protect Program Flash Page 175" edc:when="(field &amp; 0xff) == 0xAF"/>
              <edc:DCRFieldSemantic edc:cname="WPFP176" edc:desc="Write Protect Program Flash Page 176" edc:when="(field &amp; 0xff) == 0xB0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP177" edc:desc="Write Protect Program Flash Page 177" edc:when="(field &amp; 0xff) == 0xB1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP178" edc:desc="Write Protect Program Flash Page 178" edc:when="(field &amp; 0xff) == 0xB2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP179" edc:desc="Write Protect Program Flash Page 179" edc:when="(field &amp; 0xff) == 0xB3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP180" edc:desc="Write Protect Program Flash Page 180" edc:when="(field &amp; 0xff) == 0xB4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP181" edc:desc="Write Protect Program Flash Page 181" edc:when="(field &amp; 0xff) == 0xB5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP182" edc:desc="Write Protect Program Flash Page 182" edc:when="(field &amp; 0xff) == 0xB6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP183" edc:desc="Write Protect Program Flash Page 183" edc:when="(field &amp; 0xff) == 0xB7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP184" edc:desc="Write Protect Program Flash Page 184" edc:when="(field &amp; 0xff) == 0xB8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP185" edc:desc="Write Protect Program Flash Page 185" edc:when="(field &amp; 0xff) == 0xB9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP186" edc:desc="Write Protect Program Flash Page 186" edc:when="(field &amp; 0xff) == 0xBA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP187" edc:desc="Write Protect Program Flash Page 187" edc:when="(field &amp; 0xff) == 0xBB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP188" edc:desc="Write Protect Program Flash Page 188" edc:when="(field &amp; 0xff) == 0xBC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP189" edc:desc="Write Protect Program Flash Page 189" edc:when="(field &amp; 0xff) == 0xBD"/>
              <edc:DCRFieldSemantic edc:cname="WPFP190" edc:desc="Write Protect Program Flash Page 190" edc:when="(field &amp; 0xff) == 0xBE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP191" edc:desc="Write Protect Program Flash Page 191" edc:when="(field &amp; 0xff) == 0xBF"/>
              <edc:DCRFieldSemantic edc:cname="WPFP192" edc:desc="Write Protect Program Flash Page 192" edc:when="(field &amp; 0xff) == 0xC0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP193" edc:desc="Write Protect Program Flash Page 193" edc:when="(field &amp; 0xff) == 0xC1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP194" edc:desc="Write Protect Program Flash Page 194" edc:when="(field &amp; 0xff) == 0xC2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP195" edc:desc="Write Protect Program Flash Page 195" edc:when="(field &amp; 0xff) == 0xC3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP196" edc:desc="Write Protect Program Flash Page 196" edc:when="(field &amp; 0xff) == 0xC4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP197" edc:desc="Write Protect Program Flash Page 197" edc:when="(field &amp; 0xff) == 0xC5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP198" edc:desc="Write Protect Program Flash Page 198" edc:when="(field &amp; 0xff) == 0xC6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP199" edc:desc="Write Protect Program Flash Page 199" edc:when="(field &amp; 0xff) == 0xC7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP200" edc:desc="Write Protect Program Flash Page 200" edc:when="(field &amp; 0xff) == 0xC8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP201" edc:desc="Write Protect Program Flash Page 201" edc:when="(field &amp; 0xff) == 0xC9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP202" edc:desc="Write Protect Program Flash Page 202" edc:when="(field &amp; 0xff) == 0xCA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP203" edc:desc="Write Protect Program Flash Page 203" edc:when="(field &amp; 0xff) == 0xCB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP204" edc:desc="Write Protect Program Flash Page 204" edc:when="(field &amp; 0xff) == 0xCC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP205" edc:desc="Write Protect Program Flash Page 205" edc:when="(field &amp; 0xff) == 0xCD"/>
              <edc:DCRFieldSemantic edc:cname="WPFP206" edc:desc="Write Protect Program Flash Page 206" edc:when="(field &amp; 0xff) == 0xCE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP207" edc:desc="Write Protect Program Flash Page 207" edc:when="(field &amp; 0xff) == 0xCF"/>
              <edc:DCRFieldSemantic edc:cname="WPFP208" edc:desc="Write Protect Program Flash Page 208" edc:when="(field &amp; 0xff) == 0xD0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP209" edc:desc="Write Protect Program Flash Page 209" edc:when="(field &amp; 0xff) == 0xD1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP210" edc:desc="Write Protect Program Flash Page 210" edc:when="(field &amp; 0xff) == 0xD2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP211" edc:desc="Write Protect Program Flash Page 211" edc:when="(field &amp; 0xff) == 0xD3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP212" edc:desc="Write Protect Program Flash Page 212" edc:when="(field &amp; 0xff) == 0xD4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP213" edc:desc="Write Protect Program Flash Page 213" edc:when="(field &amp; 0xff) == 0xD5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP214" edc:desc="Write Protect Program Flash Page 214" edc:when="(field &amp; 0xff) == 0xD6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP215" edc:desc="Write Protect Program Flash Page 215" edc:when="(field &amp; 0xff) == 0xD7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP216" edc:desc="Write Protect Program Flash Page 216" edc:when="(field &amp; 0xff) == 0xD8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP217" edc:desc="Write Protect Program Flash Page 217" edc:when="(field &amp; 0xff) == 0xD9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP218" edc:desc="Write Protect Program Flash Page 218" edc:when="(field &amp; 0xff) == 0xDA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP219" edc:desc="Write Protect Program Flash Page 219" edc:when="(field &amp; 0xff) == 0xDB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP220" edc:desc="Write Protect Program Flash Page 220" edc:when="(field &amp; 0xff) == 0xDC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP221" edc:desc="Write Protect Program Flash Page 221" edc:when="(field &amp; 0xff) == 0xDD"/>
              <edc:DCRFieldSemantic edc:cname="WPFP222" edc:desc="Write Protect Program Flash Page 222" edc:when="(field &amp; 0xff) == 0xDE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP223" edc:desc="Write Protect Program Flash Page 223" edc:when="(field &amp; 0xff) == 0xDF"/>
              <edc:DCRFieldSemantic edc:cname="WPFP224" edc:desc="Write Protect Program Flash Page 224" edc:when="(field &amp; 0xff) == 0xE0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP225" edc:desc="Write Protect Program Flash Page 225" edc:when="(field &amp; 0xff) == 0xE1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP226" edc:desc="Write Protect Program Flash Page 226" edc:when="(field &amp; 0xff) == 0xE2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP227" edc:desc="Write Protect Program Flash Page 227" edc:when="(field &amp; 0xff) == 0xE3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP228" edc:desc="Write Protect Program Flash Page 228" edc:when="(field &amp; 0xff) == 0xE4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP229" edc:desc="Write Protect Program Flash Page 229" edc:when="(field &amp; 0xff) == 0xE5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP230" edc:desc="Write Protect Program Flash Page 230" edc:when="(field &amp; 0xff) == 0xE6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP231" edc:desc="Write Protect Program Flash Page 231" edc:when="(field &amp; 0xff) == 0xE7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP232" edc:desc="Write Protect Program Flash Page 232" edc:when="(field &amp; 0xff) == 0xE8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP233" edc:desc="Write Protect Program Flash Page 233" edc:when="(field &amp; 0xff) == 0xE9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP234" edc:desc="Write Protect Program Flash Page 234" edc:when="(field &amp; 0xff) == 0xEA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP235" edc:desc="Write Protect Program Flash Page 235" edc:when="(field &amp; 0xff) == 0xEB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP236" edc:desc="Write Protect Program Flash Page 236" edc:when="(field &amp; 0xff) == 0xEC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP237" edc:desc="Write Protect Program Flash Page 237" edc:when="(field &amp; 0xff) == 0xED"/>
              <edc:DCRFieldSemantic edc:cname="WPFP238" edc:desc="Write Protect Program Flash Page 238" edc:when="(field &amp; 0xff) == 0xEE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP239" edc:desc="Write Protect Program Flash Page 239" edc:when="(field &amp; 0xff) == 0xEF"/>
              <edc:DCRFieldSemantic edc:cname="WPFP240" edc:desc="Write Protect Program Flash Page 240" edc:when="(field &amp; 0xff) == 0xF0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP241" edc:desc="Write Protect Program Flash Page 241" edc:when="(field &amp; 0xff) == 0xF1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP242" edc:desc="Write Protect Program Flash Page 242" edc:when="(field &amp; 0xff) == 0xF2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP243" edc:desc="Write Protect Program Flash Page 243" edc:when="(field &amp; 0xff) == 0xF3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP244" edc:desc="Write Protect Program Flash Page 244" edc:when="(field &amp; 0xff) == 0xF4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP245" edc:desc="Write Protect Program Flash Page 245" edc:when="(field &amp; 0xff) == 0xF5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP246" edc:desc="Write Protect Program Flash Page 246" edc:when="(field &amp; 0xff) == 0xF6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP247" edc:desc="Write Protect Program Flash Page 247" edc:when="(field &amp; 0xff) == 0xF7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP248" edc:desc="Write Protect Program Flash Page 248" edc:when="(field &amp; 0xff) == 0xF8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP249" edc:desc="Write Protect Program Flash Page 249" edc:when="(field &amp; 0xff) == 0xF9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP250" edc:desc="Write Protect Program Flash Page 250" edc:when="(field &amp; 0xff) == 0xFA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP251" edc:desc="Write Protect Program Flash Page 251" edc:when="(field &amp; 0xff) == 0xFB"/>
              <edc:DCRFieldSemantic edc:cname="WPFP252" edc:desc="Write Protect Program Flash Page 252" edc:when="(field &amp; 0xff) == 0xFC"/>
              <edc:DCRFieldSemantic edc:cname="WPFP253" edc:desc="Write Protect Program Flash Page 253" edc:when="(field &amp; 0xff) == 0xFD"/>
              <edc:DCRFieldSemantic edc:cname="WPFP254" edc:desc="Write Protect Program Flash Page 254" edc:when="(field &amp; 0xff) == 0xFE"/>
              <edc:DCRFieldSemantic edc:cname="WPFP255" edc:desc="Write Protect Program Flash Page 255" edc:when="(field &amp; 0xff) == 0xFF"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-----nnn" edc:cname="CONFIG4H" edc:default="0xF7" edc:desc="" edc:impl="0xf7" edc:name="CONFIG4H" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xF7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Segment Write Protection Disable" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="WPDIS" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPEN" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPEND" edc:desc="Segment Write Protection End Page Select" edc:mask="0x1" edc:name="WPEND" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="WPENDMEM" edc:desc="Write Protect from WPFP to the last page of memory" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPSTARTMEM" edc:desc="write Protect from page 0 to WPFP" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPCFG" edc:desc="Write Protect Configuration Page Select" edc:mask="0x1" edc:name="WPCFG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="WPCFGDIS" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPCFGEN" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnn-nn" edc:cname="CONFIG5L" edc:default="0xFB" edc:desc="" edc:impl="0xfb" edc:name="CONFIG5L" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xFB">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="T5GSEL" edc:desc="TMR5 Gate Select bit" edc:mask="0x1" edc:name="T5GSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="T5G" edc:desc="TMR5 Gate is driven by the T5G input" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="T3G" edc:desc="TMR5 Gate is driven by the T3G input" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CINASEL" edc:desc="CxINA Gate Select bit" edc:mask="0x1" edc:name="CINASEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="DEFAULT" edc:desc="C1INA and C3INA are on their default pin locations" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RA5" edc:desc="C1INA and C3INA are all re-mapped to pin RA5" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="EASHFT" edc:desc="External Address Shift bit" edc:mask="0x1" edc:name="EASHFT" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Address Shifting enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Address Shifting disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ABW" edc:desc="Address Bus Width Select bits" edc:mask="0x3" edc:name="ABW" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="MM" edc:desc="8-bit address bus" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="XM12" edc:desc="12-bit address bus" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XM16" edc:desc="16-bit address bus" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="XM20" edc:desc="20-bit address bus" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BW" edc:desc="Data Bus Width" edc:mask="0x1" edc:name="BW" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="16" edc:desc="16-bit external bus mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="8" edc:desc="8-bit external bus mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WAIT" edc:desc="External Bus Wait" edc:mask="0x1" edc:name="WAIT" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG5H" edc:default="0xFF" edc:desc="" edc:impl="0xff" edc:name="CONFIG5H" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xFF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="IOLOCK One-Way Set Enable bit" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Once set, the IOLOCK bit cannot be cleared" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="the IOLOCK bit can be set and cleared using the unlock sequence" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LS48MHZ" edc:desc="USB Low Speed Clock Select bit" edc:mask="0x1" edc:name="LS48MHZ" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="SYSX2" edc:desc="Divide-by-2 (System clock must be 12 MHz)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SYSX1" edc:desc="Divide-by-1 (System clock must be 6 MHz)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MSSPMSK2" edc:desc="MSSP2 7-Bit Address Masking Mode Enable bit" edc:mask="0x1" edc:name="MSSPMSK2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="MSK7" edc:desc="7 Bit address masking mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MSK5" edc:desc="5 Bit address masking mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MSSPMSK1" edc:desc="MSSP1 7-Bit Address Masking Mode Enable bit" edc:mask="0x1" edc:name="MSSPMSK1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="MSK7" edc:desc="7 Bit address masking mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MSK5" edc:desc="5 bit address masking mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
